#  描述性统计的概述与计算

In [115]:
df = pd.DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],index=['a','b','c','d'],columns=['one','two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [116]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [117]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [118]:
#通过skipna参数来实现不排除NA值：
df.sum(axis=1,skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [120]:
df.idxmax(axis=0)  #返回轴向上第一个最大值出现的index，df.idxmin()返回轴向上第一个最小值出现的index

one    b
two    d
dtype: object

In [122]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

## 相关性和协方差

In [123]:
import pandas_datareader.data as web

/Users/totore/opt/anaconda3/lib/python3.7/site-packages/pandas_datareader/compat/__init__.py:7: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  from pandas.util.testing import assert_frame_equal

In [125]:
all_data = {ticker:web.get_data_yahoo(ticker) for ticker in ['AAPL','IBM','MSFT','GOOG']}

In [126]:
price = pd.DataFrame({ticker:data['Adj Close'] for ticker, data in all_data.items()})

In [127]:
price

                  AAPL         IBM        MSFT         GOOG
Date
2015-07-16  118.435951  137.587723   42.228424   579.849976
2015-07-17  119.458923  138.802673   42.192226   672.929993
2015-07-20  121.716888  139.373947   42.463726   663.020020
2015-07-21  120.500343  131.207199   42.789539   662.299988
2015-07-22  115.403839  129.018646   41.214806   662.099976
...                ...         ...         ...          ...
2020-07-08  381.369995  117.709999  212.830002  1496.000000
2020-07-09  383.010010  115.709999  214.320007  1510.989990
2020-07-10  383.679993  118.349998  213.669998  1541.739990
2020-07-13  381.910004  119.199997  207.070007  1511.339966
2020-07-14  388.230011  120.599998  208.350006  1520.579956

[1258 rows x 4 columns]

In [128]:
volume = pd.DataFrame({ticker:data['Volume'] for ticker,data in all_data.items()})
volume

                   AAPL         IBM        MSFT      GOOG
Date
2015-07-16   36222400.0   3529900.0  26271700.0   4768300
2015-07-17   46164700.0   4356400.0  29467100.0  11164900
2015-07-20   58900200.0   7377800.0  30631900.0   5860900
2015-07-21   76756400.0  13752300.0  42781900.0   3377200
2015-07-22  115450600.0   7181800.0  59152400.0   3929300
...                 ...         ...         ...       ...
2020-07-08   29273000.0   5192800.0  33600000.0   1249700
2020-07-09   31410700.0   4763000.0  33121700.0   1423300
2020-07-10   22564300.0   4285700.0  26177600.0   1856300
2020-07-13   47820100.0   4644800.0  38054400.0   1845000
2020-07-14   42747341.0   4513187.0  37591820.0   1585016

[1258 rows x 4 columns]

In [130]:
returns = price.pct_change()
returns

                AAPL       IBM      MSFT      GOOG
Date
2015-07-16       NaN       NaN       NaN       NaN
2015-07-17  0.008637  0.008830 -0.000857  0.160524
2015-07-20  0.018902  0.004116  0.006435 -0.014727
2015-07-21 -0.009995 -0.058596  0.007673 -0.001086
2015-07-22 -0.042295 -0.016680 -0.036802 -0.000302
...              ...       ...       ...       ...
2020-07-08  0.023290  0.001106  0.021993  0.007285
2020-07-09  0.004300 -0.016991  0.007001  0.010020
2020-07-10  0.001749  0.022816 -0.003033  0.020351
2020-07-13 -0.004613  0.007182 -0.030889 -0.019718
2020-07-14  0.016548  0.011745  0.006181  0.006114

[1258 rows x 4 columns]

In [131]:
#corr相关性，cov协方差

In [132]:
returns['MSFT'].corr(returns['IBM'])

0.5913609305663953

In [133]:
returns['MSFT'].cov(returns['IBM'])

0.00016625007520037794

In [134]:
returns.MSFT.cov(returns.IBM)

0.00016625007520037794

In [136]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.527274  0.715704  0.646245
IBM   0.527274  1.000000  0.591361  0.524948
MSFT  0.715704  0.591361  1.000000  0.751807
GOOG  0.646245  0.524948  0.751807  1.000000

In [138]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000333  0.000156  0.000227  0.000203
IBM   0.000156  0.000262  0.000166  0.000146
MSFT  0.000227  0.000166  0.000302  0.000225
GOOG  0.000203  0.000146  0.000225  0.000297

In [139]:
#dataframe的corrwith可以计算df中行或列与另一个序列或df的相关性
#交易量百分比变化相关性

In [142]:
returns.corrwith(volume)

AAPL   -0.139623
IBM    -0.115734
MSFT   -0.065866
GOOG   -0.056419
dtype: float64

In [143]:
#传入axis=1,会逐行计算

In [144]:
returns.corrwith(volume,axis=1)

Date
2015-07-16         NaN
2015-07-17   -0.417445
2015-07-20    0.845723
2015-07-21    0.297343
2015-07-22   -0.896118
                ...
2020-07-08    0.933941
2020-07-09    0.359280
2020-07-10   -0.987161
2020-07-13   -0.248080
2020-07-14    0.386200
Length: 1258, dtype: float64

## 唯一值、计数、成员属性

In [145]:
obj = pd.Series(['c','a','d','a','a','b','b','c','c'])

In [146]:
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [156]:
#value_counts计数

In [157]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [158]:
obj.value_counts(sort=False)

d    1
c    3
b    2
a    3
dtype: int64

In [159]:
#isin执行向量化成员属性检查，还可将数据已series或df一列的形式过滤为数据及的值子集：
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [161]:
mask = obj.isin(['b','c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [162]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [166]:
#Index.get_indexer()提供一个索引数组，可以将可能非唯一值数组转换为另一个唯一值数组
to_match = pd.Series(['c','a','b','b','c','a'])
unique = pd.Series(['c','b','a'])

In [167]:
pd.Index(unique).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2])

In [168]:
#计算DF过各相关列的直方图

In [170]:
data = pd.DataFrame({'Qu1':[1,3,4,3,4],'Qu2':[2,3,1,2,3],'Qu3':[1,5,2,4,4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [180]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0